Revit 2015 API
Hub Class
 Represents a connection between two or more Autodesk Revit Elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
public class Hub : Element
Visual Basic
Public Class Hub _
	Inherits Element
Visual C++
public ref class Hub : public Element
Remarks
Elements connected via a Hub do not refer directly to each other - they each refer to the Hub that keeps all the connectivity information.
In 2012 Hubs connect only structural Analytical Model Elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.Hub
See Also
Hub Members
Autodesk.Revit.DB.Structure Namespace